
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()

	Элементы.Status.Доступность = Параметры.Ключ.Пустая() ИЛИ НЕ ЗначениеЗаполнено(Объект.Status);

КонецПроцедуры // УстановитьДоступность()

//&НаКлиенте
//Процедура СтранаОрганизацииПриИзменении(Элемент)
//	Объект.СтранаОрганизацииРазделительДанных = GlobalMDM.ПолучитьРеквизитНаСервере(Объект.СтранаОрганизации, "Код");
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Параметры.Ключ.Пустая()
	//	И ЗначениеЗаполнено(ПараметрыСеанса.ГруппаУправленияНСИ) Тогда
	//	
	//	СтранаОрганизации = ПараметрыСеанса.ГруппаУправленияНСИ.СтранаОрганизации;
	//	
	//	Объект.СтранаОрганизации = СтранаОрганизации;
	//	Объект.СтранаОрганизацииРазделительДанных = СтранаОрганизации.Код;
	//	
	//КонецЕсли; 
	
КонецПроцедуры
