#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Строки = ЭтапыБП.НайтиСтроки(Новый Структура("Шаг",Перечисления.нсиШагиБП.Обработка));
	Если Строки.Количество() = 0 Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Настройка БП должна иметь хотя бы 1 этап на шаге ""Обработка""!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	МинимальноеВремяВыполнения = 0;
	Для Каждого Строка Из ЭтапыБП Цикл 
		МинимальноеВремяВыполнения = МинимальноеВремяВыполнения + Строка.ВремяОбработки + Строка.ВремяОжидания;
	КонецЦикла;
	Если ОбщееВремяВыполнения<МинимальноеВремяВыполнения Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Общее время выполнения меньше суммарного времени обработки и ожидания на всех этапах!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Для Каждого Стр Из ШагиБП Цикл
		ЭтапыШага = ЭтапыБП.НайтиСтроки(новый Структура("Шаг",Стр.Шаг));
		
		Для Каждого Строка Из ЭтапыШага Цикл
			Если Строка.ВремяОбработки<=Строка.ОповещатьПриОбработкеЗа Тогда 
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Шаг "+Строка.Шаг+", этап "+Строка.НомерЭтапа+": Время оповещения при обработке должно быть меньше времени обработки.";
				Сообщение.Сообщить();
			КонецЕсли;
			Если Строка.ВремяОжидания<=Строка.ОповещатьПриОжиданииЗа Тогда 
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Шаг "+Строка.Шаг+", этап "+Строка.НомерЭтапа+": Время оповещения при ожидании должно быть меньше времени ожидания.";
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.СпособРаспределения) Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Шаг "+Строка.Шаг+", этап "+Строка.НомерЭтапа+": не заполнен способ распределения.";
				Сообщение.Сообщить();
			КонецЕсли;
				
			Если Строка.СпособРаспределения = Перечисления.нсиСпособыРаспределенияЗадач.ПоРоли
				ИЛИ Строка.СпособРаспределения = Перечисления.нсиСпособыРаспределенияЗадач.ПоРолиИГруппеПользователейБП Тогда 
				
				Если НЕ ЗначениеЗаполнено(Строка.РольИсполнителя) Тогда 
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Шаг "+Строка.Шаг+", этап "+Строка.НомерЭтапа+": не заполнена роль исполнителя.";
					Сообщение.Сообщить();
				КонецЕсли;
				
				Если НЕ нсиБизнесПроцессы.ЕстьИсполнителиРоли(Строка.РольИсполнителя) Тогда 
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Шаг "+Строка.Шаг+", этап "+Строка.НомерЭтапа+": для роли не назначены исполнители.";
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

#КонецОбласти
