#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	Попытка
		УстановитьПараметрыПоУмолчанию(Настройки);  //1
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	Попытка
		УстановитьПользовательскиеНастройки(Настройки);   //3
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ЗначениеРасшифровки = Неопределено;
	Если нсиБизнесПроцессы.ЭтоЗадачаИсполнителю(Расшифровка, ДанныеРасшифровки, ЗначениеРасшифровки) Тогда
		СтандартнаяОбработка = НЕ нсиБизнесПроцессыИЗадачиКлиент.ОткрытьФормуВыполненияЗадачи(ЗначениеРасшифровки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПользовательскиеНастройки(Настройки)
	НачалоРабочегоДня = нсиБизнесПроцессы.ПолучитьДатуНачалаРабочегоДня(ТекущаяДата());
	
	ИдНастройки = нсиРаботаСФормамиСервер.ПолучитьИдПользовательскойНастройкиОтбораКД(Отчет.КомпоновщикНастроек.Настройки,"Дата начала");
	ЭлементОтбора = нсиРаботаСФормамиСервер.ПолучитьЭлементОтбораПользовательскойНастройкиКД(Настройки,ИдНастройки);
	Если ЭлементОтбора<>Неопределено Тогда 
		ЭлементОтбора.ПравоеЗначение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
		ЭлементОтбора.ПравоеЗначение.Дата = НачалоРабочегоДня;
	КонецЕсли;
	
	ИдНастройки = нсиРаботаСФормамиСервер.ПолучитьИдПользовательскойНастройкиОтбораКД(Отчет.КомпоновщикНастроек.Настройки,"Дата окончания");
	ЭлементОтбора = нсиРаботаСФормамиСервер.ПолучитьЭлементОтбораПользовательскойНастройкиКД(Настройки,ИдНастройки);
	Если ЭлементОтбора<>Неопределено Тогда 
		ЭлементОтбора.ПравоеЗначение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
		ЭлементОтбора.ПравоеЗначение.Дата = ТекущаяДата();
	КонецЕсли;
	
	
	Параметр = нсиРаботаСФормамиСервер.ПолучитьПараметрПользовательскойНастройкиКД(Настройки,"КрайнийСрок");
	Если Параметр<>Неопределено Тогда 
		Если ТипЗнч(Параметр.Значение) = Тип("СтандартнаяДатаНачала") Тогда 
			Параметр.Значение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
			Параметр.Значение.Дата = ТекущаяДата();
		Иначе
			Параметр.Значение = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию(Настройки)
	НачалоРабочегоДня = нсиБизнесПроцессы.ПолучитьДатуНачалаРабочегоДня(ТекущаяДата());
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти("КрайнийСрок");
	Если Параметр<>Неопределено Тогда
		Если ТипЗнч(Параметр.Значение) = Тип("СтандартнаяДатаНачала") Тогда 
			Параметр.Значение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
			Параметр.Значение.Дата = ТекущаяДата();
		Иначе
			Параметр.Значение = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Дата начала" Тогда 
			ЭлементОтбора.ПравоеЗначение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
			ЭлементОтбора.ПравоеЗначение.Дата = НачалоРабочегоДня;
		ИначеЕсли ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Дата окончания" Тогда 
			ЭлементОтбора.ПравоеЗначение.Вариант = ВариантСтандартнойДатыНачала.ПроизвольнаяДата;
			ЭлементОтбора.ПравоеЗначение.Дата = ТекущаяДата();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


