#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// проверка существования наименования с таким же именем и типом
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	нсиНаименованияХарактеристикУслуг.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.нсиНаименованияХарактеристикУслуг КАК нсиНаименованияХарактеристикУслуг
		|ГДЕ
		|	нсиНаименованияХарактеристикУслуг.Наименование = &Наименование
		|	И нсиНаименованияХарактеристикУслуг.Ссылка <> &Ссылка";        		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();  
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка.ТипЗначения = ТипЗначения Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такое наименование, с таким типом уже определено");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗначения.СодержитТип(Тип("СправочникСсылка.нсиУниверсальныйФункциональныйСправочник")) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидСправочника");		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
