&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокХранилище = ХранилищеОбщихНастроек.Загрузить("СписокАвтоматическиСоздаваемыхЕдиниц",,,"ЭкспертНСИ");
	Если НЕ СписокХранилище = Неопределено Тогда
		СписокЕдиниц.Загрузить(СписокХранилище.Получить());
	КонецЕсли; 
	
	ГруппаМатериаловХранилище = ХранилищеОбщихНастроек.Загрузить("ГруппаМатериалов",,,"ЭкспертНСИ");
	Если НЕ ГруппаМатериаловХранилище = Неопределено Тогда
		ГруппаМатериалов = ГруппаМатериаловХранилище.Получить();
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПередЗакрытиемНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Сохранить("СписокАвтоматическиСоздаваемыхЕдиниц",,Новый ХранилищеЗначения(СписокЕдиниц.Выгрузить()),,"ЭкспертНСИ");
	ХранилищеОбщихНастроек.Сохранить("ГруппаМатериалов",,Новый ХранилищеЗначения(ГруппаМатериалов),,"ЭкспертНСИ");
	
КонецПроцедуры
