&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПередЗакрытиемНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	Если СписокЕдиниц.Количество() 
		ИЛИ НазначениеЕдиниц.Количество() Тогда
		
		НастройкиЕдиницИзмерения = Новый Структура;
		НастройкиЕдиницИзмерения.Вставить("СписокЕдиниц", СписокЕдиниц.Выгрузить());
		НастройкиЕдиницИзмерения.Вставить("НазначениеЕдиниц", НазначениеЕдиниц.Выгрузить());
		
		Справочники.LocalMaterialType.СохранитьНастройку(ТипМатериалов, НастройкиЕдиницИзмерения);
		
	Иначе
		
		Справочники.LocalMaterialType.УдалитьНастройку(ТипМатериалов);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	СтруктураНастройки = Справочники.LocalMaterialType.ПолучитьНастройку(ТипМатериалов);
	
	ЗаполнитьФормуПоНастройкам(СтруктураНастройки);
	
	Если НЕ СтруктураНастройки = Неопределено Тогда
		ТипМатериалов = СтруктураНастройки.ВладелецНастройки;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипМатериалов = ЭтотОбъект.ВладелецФормы.Объект.LocalMaterialType;
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипМатериаловПриИзмененииНаСервере()
	
	ЗаполнитьФормуПоНастройкам(Справочники.LocalMaterialType.ПолучитьНастройку(ТипМатериалов, Ложь));
	
КонецПроцедуры

&НаКлиенте
Процедура ТипМатериаловПриИзменении(Элемент)
	
	ТипМатериаловПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоНастройкам(НастройкиЕдиницИзмеренияСтруктура)

	СписокЕдиниц.Очистить();
	НазначениеЕдиниц.Очистить();
	
	Если НЕ НастройкиЕдиницИзмеренияСтруктура = Неопределено Тогда
		
		Для каждого ЭлементНастройкиКлючИЗначение Из НастройкиЕдиницИзмеренияСтруктура.Настройка Цикл
		
			ЭтотОбъект[ЭлементНастройкиКлючИЗначение.Ключ].Загрузить(ЭлементНастройкиКлючИЗначение.Значение);
		
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьФормуПоНастройкам()



