Функция MakeReport(Report, Param)
	Попытка
		Запрос = Новый Запрос(Report);
		
		СтруктураПараметров = ЗначениеИзСтрокиВнутр(Param);
		Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
			Для каждого Параметр Из СтруктураПараметров Цикл
				Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
			КонецЦикла;
		КонецЕсли;
		
		//Возврат ЗначениеВСтрокуВнутр(Запрос.Выполнить());
		
		//***** Превратим все в строку *****
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		ТаблицаРезультата = Новый ТаблицаЗначений;
	
		Для Каждого КолонкаТЗ Из Тз.Колонки Цикл
			НК = ТаблицаРезультата.Колонки.Добавить(КолонкаТЗ.Имя);
		КонецЦикла;
		
		Для Каждого СтрТз ИЗ Тз Цикл
			Нстр = ТаблицаРезультата.Добавить();
			Для К = 0 По Тз.Колонки.Количество()-1 Цикл
				Нстр[К] = СокрЛП(СтрТз[К]);
			КонецЦикла;
		КонецЦикла;
		
		Возврат ЗначениеВСтрокуВнутр(ТаблицаРезультата);
	
	Исключение
		//ЗаписьЖурналаРегистрации("Ошибка веб-сервиса MakeReport "+ ОписаниеОшибки(), УровеньЖурналаРегистрации.Ошибка, , , );
		Возврат ОписаниеОшибки();
	КонецПопытки;
КонецФункции