#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДокументУдостоверяющийЛичность) Тогда 
		
		Попытка
				
			ДокументУдостоверяющийЛичность = Параметры.ДокументУдостоверяющийЛичность;
			Серия = Лев(ДокументУдостоверяющийЛичность, Найти(ДокументУдостоверяющийЛичность, " № ")-1);
			
			ДокументУдостоверяющийЛичность = СтрЗаменить(ДокументУдостоверяющийЛичность, Серия+" № ", "");
			Номер = Лев(ДокументУдостоверяющийЛичность, Найти(ДокументУдостоверяющийЛичность, "; ")-1);
			
			ДокументУдостоверяющийЛичность = СтрЗаменить(ДокументУдостоверяющийЛичность, Номер+"; ", "");
			КемВыдан = Лев(ДокументУдостоверяющийЛичность, Найти(ДокументУдостоверяющийЛичность, "; от ")-1);
			
			ДокументУдостоверяющийЛичность = СтрЗаменить(ДокументУдостоверяющийЛичность, КемВыдан+"; от ", "");
			КогдаВыдан = Дата(
				""+Прав(ДокументУдостоверяющийЛичность,4)+
				Сред(ДокументУдостоверяющийЛичность,4,2)+
				Лев(ДокументУдостоверяющийЛичность,2)+"000000" );
				
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Не правильный формат документа "+Параметры.ДокументУдостоверяющийЛичность);		
		КонецПопытки;	
			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(""+Серия+" № "+Номер+"; "+КемВыдан+"; от "+Формат(КогдаВыдан,"ДЛФ=D"));
	
КонецПроцедуры

#КонецОбласти
