#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПросмотрПриИзменении(Элемент)
	Если не Запись.Просмотр Тогда
		Запись.Добавление = Ложь;
		Запись.Редактирование = Ложь;
		Запись.ПометкаНаУдаление = Ложь;
		Запись.СнятиеПометкиНаУдаление = Ложь;
		Запись.Удаление = Ложь;
		Запись.УдалениеПомеченных = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.Пользователь);
	ПараметрыФормы.Вставить("ВыборГруппПользователей", Истина);
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеПриИзменении(Элемент)
	Если Запись.Добавление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПриИзменении(Элемент)
	Если Запись.Редактирование Тогда
		Запись.Просмотр = Истина;
	Иначе
		Запись.Добавление = Ложь;
		Запись.ПометкаНаУдаление = Ложь;
		Запись.СнятиеПометкиНаУдаление = Ложь;
		Запись.Удаление = Ложь;
		Запись.УдалениеПомеченных = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаНаУдалениеПриИзменении(Элемент)
	Если Запись.ПометкаНаУдаление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятиеПометкиНаУдалениеПриИзменении(Элемент)
	Если Запись.СнятиеПометкиНаУдаление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПриИзменении(Элемент)
	Если Запись.Удаление Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПомеченныхПриИзменении(Элемент)
	Если Запись.УдалениеПомеченных Тогда
		Запись.Просмотр = Истина;
		Запись.Редактирование = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
