
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	Если Источник.Модифицированность Тогда
		ПоказатьПредупреждение(,"Внимание! Регистрация не может выть выполнена. Сначала запишите объект.");
	Иначе	
		Если ТипЗнч(Источник.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			ВыполнитьРегистрациюПоСписку(Источник.ТекущийЭлемент);
		Иначе
			Список = Источник.Элементы.Найти("Список");
			Если Список = Неопределено Тогда
				ПоказатьПредупреждение(,"Внимание! Регистрация не выполнена. Выберите объект регистрации в списке.");
			Иначе
				Источник.ТекущийЭлемент = Список;
				ВыполнитьРегистрациюПоСписку(Источник.ТекущийЭлемент);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегистрациюПоСписку(Список)
	
	Если Список.ВыделенныеСтроки.Количество() Тогда
		Для каждого Значение Из Список.ВыделенныеСтроки Цикл
			ВыполнитьРегистрациюНаСервере(Значение);
			ПоказатьОповещениеПользователя("Регистрация: "+Значение,,"Регистрация объектов",БиблиотекаКартинок.Успешно32,,);
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Внимание! Регистрация не выполнена. Выберите объект регистрации в списке.");
	КонецЕсли; 
	
КонецПроцедуры // ВыполнитьРегистрациюПоСписку()
 
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Значение)

	ПланыОбмена.Обмен_МДМ_УПП.ВыполнитьРегистрациюДляУПП(Значение);
	
КонецПроцедуры // ВыполнитьРегистрациюНаСервере()
 