#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ВидСправочника = ПараметрыВыполненияКоманды.Источник.Параметры.ВидСправочника;
	ПараметрыФормы.Вставить("Отбор",
		новый Структура("Владелец,ТипПозиции", 
			ВидСправочника,
			ПредопределенноеЗначение("Перечисление.нсиТипыПозицийСправочников.ЭталоннаяПозиция")
		)
	);
	
	ОткрытьФорму(нсиУниверсальноеХранилище.ПолучитьИмяФормы(ВидСправочника)+".ФормаСписка", ПараметрыФормы, , ВидСправочника.УникальныйИдентификатор(), ПолучитьОкна()[0]);
	
КонецПроцедуры

#КонецОбласти

