
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_ДополнительнаяКлассификация = Новый Структура;
	Настройки_ДополнительнаяКлассификация.Вставить("КлючСтроки", "ВидКлассификатора,Класс");
	Настройки_ДополнительнаяКлассификация.Вставить("Реквизиты" , "");
	Настройки_ДополнительнаяКлассификация.Вставить("Элемент"   , "ДополнительнаяКлассификация");
	
	Настройки_ТехническиеХарактеристики = Новый Структура;
	Настройки_ТехническиеХарактеристики.Вставить("КлючСтроки"     , "Характеристика");
	Настройки_ТехническиеХарактеристики.Вставить("Реквизиты"      , "Значение");
	Настройки_ТехническиеХарактеристики.Вставить("РеквизитФормы"  , "ТехническиеХарактеристикиФорма");
	Настройки_ТехническиеХарактеристики.Вставить("Элемент"        , "ТехническиеХарактеристикиФорма");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("ДополнительнаяКлассификация"   , Настройки_ДополнительнаяКлассификация);
	НастройкиОформления.Вставить("ТехническиеХарактеристики"     , Настройки_ТехническиеХарактеристики);
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти