#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Автор", ПользователиКлиентСервер.ТекущийПользователь());
	ОткрытьФорму("БизнесПроцесс.нсиИзменениеЭлементаСправочника.ФормаСписка", 
		Новый Структура("Отбор, Предмет", ПараметрыФормы, ПараметрКоманды), 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
