
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_АльтернативныеЕдиницыИзмерения = Новый Структура;
	Настройки_АльтернативныеЕдиницыИзмерения.Вставить("КлючСтроки", "ЕдиницаИзмерения");
	Настройки_АльтернативныеЕдиницыИзмерения.Вставить("Реквизиты" , "Коэффициент,Назначение");
	Настройки_АльтернативныеЕдиницыИзмерения.Вставить("Элемент"   , "АльтернативныеЕдиницыИзмерения");
	
	Настройки_ДополнительнаяКлассификация = Новый Структура;
	Настройки_ДополнительнаяКлассификация.Вставить("КлючСтроки", "ВидКлассификатора,Класс");
	Настройки_ДополнительнаяКлассификация.Вставить("Реквизиты" , "");
	Настройки_ДополнительнаяКлассификация.Вставить("Элемент"   , "ДополнительнаяКлассификация");
	
	Настройки_Аналоги = Новый Структура;
	Настройки_Аналоги.Вставить("КлючСтроки", "Аналог");
	Настройки_Аналоги.Вставить("Реквизиты" , "");
	Настройки_Аналоги.Вставить("Элемент"   , "Аналоги");
	
	Настройки_Запчасти = Новый Структура;
	Настройки_Запчасти.Вставить("КлючСтроки", "Запчасть");
	Настройки_Запчасти.Вставить("Реквизиты" , "");
	Настройки_Запчасти.Вставить("Элемент"   , "Запчасти");
	
	Настройки_ТехническиеХарактеристики = Новый Структура;
	Настройки_ТехническиеХарактеристики.Вставить("КлючСтроки"     , "Характеристика");
	Настройки_ТехническиеХарактеристики.Вставить("Реквизиты"      , "Значение");
	Настройки_ТехническиеХарактеристики.Вставить("РеквизитФормы"  , "ТехническиеХарактеристикиФорма");
	Настройки_ТехническиеХарактеристики.Вставить("Элемент"        , "ТехническиеХарактеристикиФорма");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("АльтернативныеЕдиницыИзмерения", Настройки_АльтернативныеЕдиницыИзмерения);
	НастройкиОформления.Вставить("ДополнительнаяКлассификация"   , Настройки_ДополнительнаяКлассификация);
	НастройкиОформления.Вставить("Аналоги"                       , Настройки_Аналоги);
	НастройкиОформления.Вставить("Запчасти"                      , Настройки_Запчасти);
	НастройкиОформления.Вставить("ТехническиеХарактеристики"     , Настройки_ТехническиеХарактеристики);
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти
