
&НаСервереБезКонтекста
Процедура РегистрацияНаСервере()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	Выборка = РегистрыСведений.БуферОбмена.Выбрать(Отбор);
	НаборЗаписей = РегистрыСведений.БуферОбмена.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.Обмен_МДМ_УПП.ВыполнитьРегистрациюДляУПП(Выборка.Объект, Истина);
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Регистрация(Команда)
	РегистрацияНаСервере();
	Оповестить("ОбновитьБуферОбмена");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьБуферОбмена" Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоПользователю();
КонецПроцедуры

Процедура УстановитьОтборПоПользователю()

	Если Список.Отбор.Элементы.Количество() Тогда
		Отбор = Список.Отбор.Элементы[0];
	Иначе
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Пользователь").Поле;
	КонецЕсли; 
	Отбор.ПравоеЗначение = Пользователи.ТекущийПользователь();

КонецПроцедуры // 	УстановитьОтборПоВладельцу()
