#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Предопределенный Тогда
		Элементы.Наименование.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Адрес = ПоместитьВоВременноеХранилище(ТекущийОбъект.Формы.Получить(), УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПустаяСтрока(Адрес) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формы не загружены.",,,,Отказ);
		Возврат;
	КонецЕсли;
	ТекущийОбъект.Формы = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьФормы(Команда)
	ВыбранноеИмя = "";
	НачатьПомещениеФайла(,Адрес,"",Истина,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФормы(Команда)
	Если ПустаяСтрока(Адрес) Тогда
		ПоказатьПредупреждение(,"Формы не загружены.");
		Возврат;
	КонецЕсли;
	ИмяФайла = "";
	ПолучитьФайл(Адрес, ИмяФайла, Истина);
КонецПроцедуры

#КонецОбласти

