#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ВидСправочника = ПараметрыВыполненияКоманды.Источник.Параметры.ВидСправочника;
	ПараметрыФормы.Вставить("Отбор",новый Структура("Владелец", ВидСправочника));
	
	ОткрытьФорму(нсиУниверсальноеХранилище.ПолучитьИмяФормы(ВидСправочника)+"ФормаСпискаДублей", ПараметрыФормы, , ВидСправочника.УникальныйИдентификатор(), ПолучитьОкна()[0]);
	
КонецПроцедуры

#КонецОбласти
