#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//нсиБизнесПроцессы.ЗаполнитьСписокСправочниковВедущихсяПоЗаявкам(Элементы.ИспользуетсяДляСправочника.СписокВыбора);
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		Если Справочник.Реквизиты.Найти("ЭтоМакет")<>Неопределено
			И Справочник.Имя <> "нсиУниверсальныйФункциональныйСправочник"
			И Справочник.Имя <> "нсиУниверсальныйКлассификатор" Тогда
			
			Элементы.ИспользуетсяДляСправочника.СписокВыбора.Добавить(Справочник.Имя,Справочник.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	нсиВидыСправочников.Ссылка,
	|	нсиВидыСправочников.Наименование
	|ИЗ
	|	Справочник.нсиВидыСправочников КАК нсиВидыСправочников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.нсиПраваДоступаНаВидыСправочников КАК нсиПраваДоступаНаВидыСправочников
	|		ПО нсиВидыСправочников.Ссылка = нсиПраваДоступаНаВидыСправочников.ВидСправочника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО (нсиПраваДоступаНаВидыСправочников.Пользователь = СоставыГруппПользователей.ГруппаПользователей)
	|ГДЕ
	|	НЕ нсиВидыСправочников.ПометкаУдаления
	|	И СоставыГруппПользователей.Используется
	|	И нсиПраваДоступаНаВидыСправочников.Просмотр
	|	И СоставыГруппПользователей.Пользователь = &Пользователь
	|	И нсиВидыСправочников.ВидСправочника = ЗНАЧЕНИЕ(Перечисление.нсиВидыСправочников.ФункциональныйСправочник)"
	);
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ИспользуетсяДляСправочника.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Элементы.ИспользуетсяДляСправочника.СписокВыбора.СортироватьПоПредставлению();
	
	УстановитьПривилегированныйРежим(Ложь);	
		
КонецПроцедуры

#КонецОбласти
