
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_НастройкиШаблоновНаименований = Новый Структура;
	Настройки_НастройкиШаблоновНаименований.Вставить("КлючСтроки", "ТипЭлемента,ЭлементНаименования");
	Настройки_НастройкиШаблоновНаименований.Вставить("Реквизиты" , "");
	Настройки_НастройкиШаблоновНаименований.Вставить("Элемент"   , "НастройкиШаблоновНаименований");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("НастройкиШаблоновНаименований"   , Настройки_НастройкиШаблоновНаименований);
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти