
#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_ДополнительнаяКлассификация = Новый Структура;
	Настройки_ДополнительнаяКлассификация.Вставить("КлючСтроки", "ВидКлассификатора,Класс");
	Настройки_ДополнительнаяКлассификация.Вставить("Реквизиты" , "");
	Настройки_ДополнительнаяКлассификация.Вставить("Элемент"   , "ДополнительнаяКлассификация");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("ДополнительнаяКлассификация"   , Настройки_ДополнительнаяКлассификация);
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти

//interface Global
Функция GetDataSet(Ссылка) Экспорт 
	
	СсылкаСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "LocalEntity,Entity,Type,DetailedType,Наименование,ExistingLocalID,IsSupplier,IsCustomer,IsNonTrade,IsInstitution,Market,Incoterms,DeliveryAddress,Currency");
	
	DataSet = Новый Структура;
	DataSet.Вставить("GUID", Строка(Ссылка.УникальныйИдентификатор()));
	DataSet.Вставить("LocalID", СокрЛП(СсылкаСтруктура.LocalEntity.Код));
	DataSet.Вставить("Entity", СокрЛП(СсылкаСтруктура.Entity.Код));
	DataSet.Вставить("Type", Строка(СсылкаСтруктура.Type));
	DataSet.Вставить("DetailedType", Строка(СсылкаСтруктура.DetailedType));
	DataSet.Вставить("FullName", СсылкаСтруктура.Наименование);
	DataSet.Вставить("ExistingLocalID", СсылкаСтруктура.ExistingLocalID);                                                     
	DataSet.Вставить("IsSupplier", Формат(СсылкаСтруктура.IsSupplier, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("IsCustomer", Формат(СсылкаСтруктура.IsCustomer, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("IsNonTrade", Формат(СсылкаСтруктура.IsNonTrade, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("IsInstitution", Формат(СсылкаСтруктура.IsInstitution, "БЛ='0'; БИ='1'"));
	DataSet.Вставить("Market", СсылкаСтруктура.Market.КодАльфа2);
	DataSet.Вставить("Incoterms", СсылкаСтруктура.Incoterms.Код);
	DataSet.Вставить("DeliveryAddress", СсылкаСтруктура.DeliveryAddress);
	DataSet.Вставить("Currency", СокрЛП(СсылкаСтруктура.Currency));
	
	Возврат DataSet;

КонецФункции // GetDataSet()

Функция АтрибутыGlobal() Экспорт 

	АтрибутыGlobal = Новый Структура;
	
	Возврат АтрибутыGlobal;
	
КонецФункции // РеквизитыДляЗапросаНового()

Функция ИдентификаторыGlobal() Экспорт 

	ИдентификаторыGlobal = Новый Структура;
	ИдентификаторыGlobal.Вставить("GlobalID", "GlobalID");
	
	Возврат ИдентификаторыGlobal;
	
КонецФункции // РеквизитыДляЗапросаНового()

Функция ВыполнитьПроверкуОтвета(ОтветСтрока) Экспорт 

	Результат = Новый Структура;
	
	Результат.Вставить("result", Истина);
	//Если СтрДлина(СокрЛП(ОтветСтрока.GlobalID)) = 18 Тогда
	//	Результат.Вставить("result", Истина);
	//Иначе
	//	ОписаниеОшибки = "Длина Global ID не соответствует шаблону.";
	//	Результат.Вставить("error", ОписаниеОшибки);
	//КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ВыполнитьПроверкуОтвета()

