#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ИспользоватьПоУмолчанию Тогда 
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.нсиСоответствиеПользователейИГруппПользователейБП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Пользователь", ТекущийОбъект.Пользователь);
		Блокировка.Заблокировать();
		
		Набор = РегистрыСведений.нсиСоответствиеПользователейИГруппПользователейБП.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(ТекущийОбъект.Пользователь);
		Набор.Прочитать();
		Для Каждого Строка Из Набор Цикл 
			Если Строка.ГруппаПользователейБП <> ТекущийОбъект.ГруппаПользователейБП Тогда 
				Строка.ИспользоватьПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначениеКопирования") Тогда 
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
			Запись.ИспользоватьПоУмолчанию = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
