&НаКлиенте
Процедура ЗагрузитьПравилоВыгрузки(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр = "Табличный документ (База Compass (*.xml*)|*.xml";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлНаДиске = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		ИмяФайла = ФайлНаДиске.ПолноеИмя;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
    ТД = Новый ТекстовыйДокумент;
	ТД.Прочитать(ИмяФайла);	
	
	ЗагрузитьПравилоВыгрузкиНаСервере(ТД);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПравилоВыгрузкиНаСервере(ТД)
	
	ХЗ = Новый ХранилищеЗначения(ТД.ПолучитьТекст(),Новый СжатиеДанных(9));
	
	ПравилаОбменаМЗ = РегистрыСведений.ПравилаОбмена.СоздатьМенеджерЗаписи();
	ПравилаОбменаМЗ.ПравилаОбмена = "ExchangeXML";
	ПравилаОбменаМЗ.Прочитать();
	Если НЕ ПравилаОбменаМЗ.Выбран() Тогда
		ПравилаОбменаМЗ.ПравилаОбмена = "ExchangeXML";
	КонецЕсли;
	ПравилаОбменаМЗ.ПравилоВыгрузки = ХЗ;
	ПравилаОбменаМЗ.Записать();
	
КонецПроцедуры
