
&НаСервере
Процедура СоздатьНастройкиТранспортаНаСервере()
	
	   Запись=РегистрыСведений.НастройкиТранспортаОбмена.СоздатьМенеджерЗаписи();
	   Запись.Узел=Объект.Узел;
	   Запись.WSURLВебСервиса= Объект.WSURLВебСервиса;
	   Запись.WSИмяПользователя=Объект.WSИмяПользователя;
	   Запись.WSЗапомнитьПароль=Истина;
	   Запись.WSИспользоватьПередачуБольшогоОбъемаДанных=Объект.WSИспользоватьПередачуБольшогоОбъемаДанных;
	   Запись.ВидТранспортаСообщенийОбменаПоУмолчанию= Перечисления.ВидыТранспортаСообщенийОбмена.WS;
	   Запись.Записать();
	   
	   //ставим узлу организацию для пользовательской регистрации изменений
	   ОбъектУзел=Объект.Узел.ПолучитьОбъект();
	   ОбъектУзел.Организация=Объект.Организация;
	   ОбъектУзел.Записать();	   
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкиТранспорта(Команда)
	СоздатьНастройкиТранспортаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьПарольНаСервере()
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Узел, Объект.ПарольДляБезопасногоХранилища, "Пароль");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПароль(Команда)
	СохранитьПарольНаСервере();
КонецПроцедуры
