#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьЗаписиБезСобытий(Команда)
	ПроверитьЗаписиБезСобытийНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПроверитьЗаписиБезСобытийНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Ссылка, ЭтоГруппа ИЗ Справочник.нсиМТР
		|ГДЕ (НЕ ЭтоГруппа)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ Ссылка, ЭтоГруппа ИЗ Справочник.нсиУслуги
		|ГДЕ (НЕ ЭтоГруппа)";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбъектОбработки = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ОбъектОбработки.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
