#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ТекущийРаздел", "ОбщиеНастройки");
	
	#Если ВебКлиент Тогда
	ОкноОткрытияПанели = ПараметрыВыполненияКоманды.Окно;
	#Иначе
	ОкноОткрытияПанели = ПараметрыВыполненияКоманды.Источник;
	#КонецЕсли 

	ОткрытьФорму("ОбщаяФорма.нсиФормаВидовСправочников", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ОкноОткрытияПанели);
	
	// Оповестим для режима закладок
	Оповестить("ПереключениеРазделаАдминистрирования", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти
