#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиЭлемент(Команда)
	Если не ЗначениеЗаполнено(Объект.GUID) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан идентификатор элемента!",,"Объект.GUID");
	Иначе
		ПолучитьЭлементНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьGUID(Команда)
	Если не ЗначениеЗаполнено(Объект.Элемент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан элемент справочника!",,"Объект.Элемент");
	Иначе
		Объект.GUID = Строка(Объект.Элемент.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьЭлементНаСервере()
	Попытка
		УникИдентификатор = Новый УникальныйИдентификатор(Объект.GUID);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верный формат GUID!",,"Объект.GUID");
		Возврат;
	КонецПопытки;
	ЭлементНайден = Ложь;
	Для каждого спр из Метаданные.Справочники цикл
		СсылкаНаЭлемент = Справочники[спр.Имя].ПолучитьСсылку(УникИдентификатор);
		Если ЗначениеЗаполнено(СсылкаНаЭлемент) и Найти(Строка(СсылкаНаЭлемент), "Объект не найден") = 0 Тогда
			Объект.Элемент = СсылкаНаЭлемент;
			ЭлементНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если не ЭлементНайден Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить элемент справочника!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
