
#Область ПрограммныйИнтерфейс

// Получает первичную информацию об ошибке.
// Параметры:
//	ИнформацияОбОшибке - информация об ошибке.
// Возвращает:
//	Информацию об ошибке, которая является первопричиной возникновения переданной ИнформацияОбОшибке.
//  Если ошибка первичная, то возвращается сама ошибка, переданная в качестве параметра.
Функция ПолучитьПричинуОшибки(ИнформацияОбОшибке) Экспорт
	ПричинаОшибки = ИнформацияОбОшибке.Причина;
	Если ПричинаОшибки = НеОпределено Тогда
		Возврат ИнформацияОбОшибке;
	КонецЕсли;
	Пока ПричинаОшибки.Причина <> НеОпределено Цикл
		ПричинаОшибки = ПричинаОшибки.Причина;
	КонецЦикла;
	Возврат ПричинаОшибки;
	
КонецФункции

#КонецОбласти