
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "ДанныеКартинки");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИзображения(Команда)
	
	ПоказыватьИзображения = НЕ ПоказыватьИзображения;
	
	Элементы.СписокПоказыватьИзображения.Пометка = ПоказыватьИзображения;
	Элементы.СсылкаНаКартинку.Видимость = ПоказыватьИзображения;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПослеЗаписи" Тогда
	
		Если НЕ Элементы.Список.ТекущаяСтрока = Неопределено Тогда
			СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока, "ДанныеКартинки");
			Элементы.СсылкаНаКартинку.Обновить();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СписокПоказыватьИзображения.Пометка = ПоказыватьИзображения;
	Элементы.СсылкаНаКартинку.Видимость = ПоказыватьИзображения;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьGUID(Команда)
	Элементы.СписокПоказыватьGUID.Пометка = НЕ Элементы.СписокПоказыватьGUID.Пометка;
	Элементы.GUID.Видимость = Элементы.СписокПоказыватьGUID.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьGlobalID(Команда)
	Элементы.СписокПоказыватьGlobalID.Пометка = НЕ Элементы.СписокПоказыватьGlobalID.Пометка;
	Элементы.GlobalIDs.Видимость = Элементы.СписокПоказыватьGlobalID.Пометка;
КонецПроцедуры
