
&НаКлиенте
Процедура ЗагрузитьПравилоВыгрузки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,,,Истина, УникальныйИдентификатор);
	Попытка
		Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Правила успешно загружены.";
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли; 
	
	СсылкаНаПравилаВыгрузки = Адрес;

КонецПроцедуры // ОбработкаВыбораФайла()
 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаПравилаВыгрузки) Тогда
		ТекущийОбъект.ПравилоВыгрузки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СсылкаНаПравилаВыгрузки));
	КонецЕсли; 	
КонецПроцедуры

//&НаКлиенте
//Процедура ВыгрузитьПравилоВыгрузки(Команда)
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	СсылкаНаПравилаВыгрузки = ПолучитьНавигационнуюСсылку(Запись, "ПравилоВыгрузки");
//КонецПроцедуры
