
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Согласование(Команда)
	
	Если ЭтаФорма.Записать() Тогда
		InteractiveMode = истина;
		СогласованиеНаСервере(InteractiveMode);
		ЭтаФорма.Записать();
	Иначе
		Сообщить("Не удалось отправить запрос. Ошибка Записи.");
	КонецЕсли; 
	
	Закрыть(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура СогласованиеНаСервере(InteractiveMode)
	
	ЗначениеВРеквизитФормы(GlobEx.ОтправитьНаСогласование(РеквизитФормыВЗначение("Объект"), InteractiveMode), "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураGlobal = Неопределено;
	Если Параметры.Свойство("СтруктураGlobal", СтруктураGlobal) Тогда
		ЗаполнитьЗначенияСвойств(Объект, СтруктураGlobal);
	Иначе
		Элементы.ГруппаКнопокОтправкиНаСогласование.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры
