
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыделенныеСтроки = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки;
	Для каждого Значение Из ВыделенныеСтроки Цикл
		ВыполнитьРегистрациюНаСервере(Значение);
		ПоказатьОповещениеПользователя("Регистрация: "+Значение,,"Регистрация объектов",БиблиотекаКартинок.Успешно32,,);
	КонецЦикла;
	Оповестить("ОбновитьБуферОбмена");
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Значение)

	ПланыОбмена.Обмен_МДМ_УПП.ВыполнитьРегистрациюДляУПП(Значение, Истина);
	
	//НаборЗаписей = РегистрыСведений.БуферОбмена.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Объект.Установить(Значение);
	//НаборЗаписей.Записать();

КонецПроцедуры // ВыполнитьРегистрациюНаСервере()
 