Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Календари.Ссылка,Календари.Наименование
		|ИЗ
		|	Справочник.Календари КАК Календари
		|ГДЕ
		|	Календари.Ссылка <> &Ссылка
		|	И Календари.ВладелецКалендаря = &ВладелецКалендаря"
	);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ВладелецКалендаря",ВладелецКалендаря);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Отказ = Истина;
		ТекстСообщения = "Для данного владельца уже есть календарь """+Выборка.Наименование+"""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ПериодыДействия Из ПериодыДействияГрафика Цикл 
		Для Каждого ДеньНедели ИЗ Перечисления.нсиДниНедели Цикл 
			Строки = ПериодыГрафика.НайтиСтроки(новый Структура("ДеньНедели,КлючСтроки",ДеньНедели,ПериодыДействия.КлючСтроки));
			Для АА = 0 ПО Строки.Количество()-1 Цикл 
				Для ББ = АА+1 По Строки.Количество()-1 Цикл 
					Если (Строки[АА].ВремяНачала >= Строки[ББ].ВремяНачала И Строки[АА].ВремяНачала <= Строки[ББ].ВремяОкончания)
						ИЛИ (Строки[АА].ВремяОкончания >= Строки[ББ].ВремяНачала И Строки[АА].ВремяОкончания <= Строки[ББ].ВремяОкончания)
						ИЛИ (Строки[ББ].ВремяНачала >= Строки[АА].ВремяНачала И Строки[ББ].ВремяНачала <= Строки[АА].ВремяОкончания)
						ИЛИ (Строки[ББ].ВремяОкончания >= Строки[АА].ВремяНачала И Строки[ББ].ВремяОкончания <= Строки[АА].ВремяОкончания)
						Тогда
							ТекстСообщения =	"Периоды на дату начала действия "+Формат(ПериодыДействия.ДатаИзмененияРасписания,"ДФ=dd.MM.yyyy") 
												+" на день недели "+Строки[АА].ДеньНедели +" перекрываются!";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
						КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВладелецКалендаря = Неопределено;
КонецПроцедуры



