#Область ПрограммныйИнтерфейс

// Вычисляет элемент справочника для быстрого поиска.
Функция ПолучитьСсылкуНаЭлементСервер(СтрокаБыстрогоПоиска, ИмяСправочника) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	нсиОбщийСправочник.Ссылка
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК нсиОбщийСправочник
	|ГДЕ
	|	нсиОбщийСправочник.Наименование ПОДОБНО &СтрокаБыстрогоПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	нсиОбщийСправочник.Наименование";
	
	Запрос.УстановитьПараметр("СтрокаБыстрогоПоиска", СтрокаБыстрогоПоиска + "%");
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Определяет значение перечисления нсиЮрФизЛицо равно ЮрЛицо или нет.
//
// Параметры:
// ЮрФизЛицо - ПеречислениСсылка.нсиЮрФизЛицо - значение перечисления.
//
// Возвращаемое значение:
// Булево - Истина - ЮрФизЛицо = ЮрЛицо, Ложь - иначе.
//
Функция ЭтоЮрЛицо(ЮрФизЛицо) Экспорт
	
	Если ЮрФизЛицо = Перечисления.нсиЮрФизЛицо.ЮрЛицо Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Проверяет, заполнены ли обязательные технические характеристики.
//
// Параметры:
//		ТехническиеХарактеристики - ТабличннаяЧасть - табличная часть характеристик объекта.
//		Отказ - Булево - признак отказа.
//
Процедура  ПроверитьТехническиеХарактеристики(ТехническиеХарактеристики, Отказ)		Экспорт 
	
	Для Каждого Строка Из ТехническиеХарактеристики Цикл
		Если Строка.Характеристика.ЗаполнятьОбязательно И Не ЗначениеЗаполнено(Строка.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Значение характеристики '" + Строка.Характеристика.Наименование +  "' не заполнено!",
			, 
			,
			,
			Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
