
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Справочники.нсиДомены.ЗаполнитьСписокСправочников(Элементы.СправочникиСправочник.СписокВыбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СправочникиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	нсиРаботаСФормамиКлиент.ПроверитьУникальностьСтроки(
		Элементы.Справочники,
		Объект.Справочники,
		"Справочник",
		ОтменаРедактирования,
		Отказ
	);
КонецПроцедуры

#КонецОбласти