
#Область СлужебныеПроцедурыИФункции

// Получить структуру с описанием формы выполнения задачи.
// Вызывается при открытии формы выполнения задачи.
//
// Параметры
//   ЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – задача 
//   ТочкаМаршрутаСсылка – точка маршрута 
//
// Возвращаемое значение:
//   Структура   – структуру с описанием формы выполнения задачи.
//                 Ключ "ИмяФормы" содержит имя формы, передаваемое в метод контекста ОткрытьФорму(). 
//                 Ключ "ПараметрыФормы" содержит параметры формы. 
//
Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ", ЗадачаСсылка));
	Результат.Вставить("ИмяФормы", "БизнесПроцесс.нсиВводНовогоЭлементаСправочника.Форма.Действие" + 
		ТочкаМаршрутаБизнесПроцесса.Имя);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьШаги() Экспорт
	Шаги = новый Массив;
	Шаги.Добавить(Перечисления.нсиШагиБП.РаспределениеЗадач);
	Шаги.Добавить(Перечисления.нсиШагиБП.Обработка);
	Шаги.Добавить(Перечисления.нсиШагиБП.Утверждение);
	Возврат Шаги;
КонецФункции

#КонецОбласти