#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВидСправочника = ПараметрыВыполненияКоманды.Источник.Параметры.ВидСправочника;
	ПараметрыФормы = Новый Структура(
		"РежимРаботы, ВидСправочника",
		"Обработка буфера записей",
		ВидСправочника
	);
	ОткрытьФорму(нсиУниверсальноеХранилище.ПолучитьИмяФормы(ВидСправочника)+"ФормаОбработкиИсходныхЗаписей", ПараметрыФормы, , ВидСправочника.УникальныйИдентификатор(), ПолучитьОкна()[0]);
		
КонецПроцедуры

#КонецОбласти
