Процедура РегистрацияAX(Узел, Ссылка) Экспорт 

	Владелец = Ссылка.Владелец;
	
	РегистрацияОрганизация = Ссылка.Организация.ВыгрузкаAX;
	РегистрацияНеУдаленные = НЕ Ссылка.ПометкаУдаления И НЕ Владелец.ПометкаУдаления;
	РегистрацияПоставщик = Ссылка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
							И Владелец.Родитель.ВыгрузкаAX;
	РегистрацияПокупатель = Ссылка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
							И Владелец.СтатусМСФО > 0;
	
	Если РегистрацияОрганизация
		И РегистрацияНеУдаленные 
		И (РегистрацияПоставщик
		ИЛИ РегистрацияПокупатель) 
		Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
		
	КонецЕсли; 
	
КонецПроцедуры
 