
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	Попытка
		УстановитьПараметрыПоУмолчанию(Настройки);  
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	Попытка
		УстановитьПользовательскиеНастройки(Настройки);   
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ЗначениеРасшифровки = Неопределено;
	Если БизнесПроцессыИЗадачиВызовСервера.ЭтоЗадачаИсполнителю(Расшифровка, ДанныеРасшифровки, ЗначениеРасшифровки) Тогда 
		СтандартнаяОбработка = НЕ нсиБизнесПроцессыИЗадачиКлиент.ОткрытьФормуВыполненияЗадачи(ЗначениеРасшифровки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПользовательскиеНастройки(Настройки)
	НачалоРабочегоДня = нсиБизнесПроцессы.ПолучитьДатуНачалаРабочегоДня(ТекущаяДата());
	
	нсиРаботаСФормамиСервер.УстановитьДатуВПользовательскиеНастройкиПараметраКД(
		Настройки,
		"НачалоПериода",
		НачалоРабочегоДня
	);
	
	нсиРаботаСФормамиСервер.УстановитьДатуВПользовательскиеНастройкиПараметраКД(
		Настройки,
		"ОкончаниеПериода",
		ТекущаяДата()
	);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию(Настройки)
	НачалоРабочегоДня = нсиБизнесПроцессы.ПолучитьДатуНачалаРабочегоДня(ТекущаяДата());
	
	нсиРаботаСФормамиСервер.УстановитьДатуВПараметрНастроекКД(
		Настройки,
		"НачалоПериода",
		НачалоРабочегоДня
	);
	
	нсиРаботаСФормамиСервер.УстановитьДатуВПараметрНастроекКД(
		Настройки,
		"ОкончаниеПериода",
		ТекущаяДата()
	);
	
КонецПроцедуры

#КонецОбласти

