
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидКлассификатора = Параметры.ВидКлассификатора;
	нсиРаботаСФормами.ОтборВСпискеПоЗначению(Список.Отбор.Элементы,"ВидКлассификатора",ВидКлассификатора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидКлассификатораПриИзменении(Элемент)
	нсиРаботаСФормами.ОтборВСпискеПоЗначению(Список.Отбор.Элементы,"ВидКлассификатора",ВидКлассификатора);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОткрытьФорму("ПланВидовХарактеристик.нсиНаименованияХарактеристикУниверсальногоСправочника.ФормаОбъекта",
		новый Структура("ЗначенияЗаполнения", новый Структура("ВидКлассификатора",ВидКлассификатора)),
		ЭтаФорма
	);
КонецПроцедуры

#КонецОбласти
