
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	
	Значение = Источник.Объект.Ссылка;

	Если ЗначениеЗаполнено(Значение)
		И НЕ Источник.Модифицированность Тогда
		ВыполнитьРегистрациюНаСервере(Значение);
		ПоказатьОповещениеПользователя("Регистрация: "+Значение,,"Регистрация объектов",БиблиотекаКартинок.Успешно32,,);
	Иначе
		ПоказатьПредупреждение(,"Внимание! Регистрация не может выть выполнена. Сначала запишите объект.");
	КонецЕсли; 
	
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Значение)

	ПланыОбмена.Обмен_МДМ_УПП.ВыполнитьРегистрациюДляУПП(Значение);
	
КонецПроцедуры // ВыполнитьРегистрациюНаСервере()
 