#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщиеНастройки;
	Элементы.ОбщиеНастройки.Пометка = Истина;
	ЗаголовокСтраницы = "Общие настройки";
	ПредыдущаяКоманда = "ОбщиеНастройки";
	Элементы.ОбщиеНастройки.Шрифт = Новый Шрифт(, 8, Истина, , , );
	
	Элементы.нсиИспользоватьПодсистемуДоговоровСПокупателями.Доступность = НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов;
	Элементы.нсиИспользоватьПодсистемуДоговоровСПоставщиками.Доступность = НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов;
	Элементы.нсиИспользоватьПодсистемуБанковскихСчетов.Доступность 		= НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов;
	
	ТекущаяИБ = СтрокаСоединенияИнформационнойБазы();
	
	НастройкаЦветов = Константы.нсиНастройкаЦветовВизуализации.Получить();
	СтруктураЦветов = НастройкаЦветов.Получить();
	Если СтруктураЦветов = Неопределено Тогда
		ЦветКириллицы 	= Новый Цвет(0,0,0);
		ЦветЛатиницы 	= Новый Цвет(0,0,0);
		ЦветЦифры 		= Новый Цвет(0,0,0);
	Иначе
		ЦветКириллицы 	= СтруктураЦветов.ЦветКириллицы;
		ЦветЛатиницы 	= СтруктураЦветов.ЦветЛатиницы;
		ЦветЦифры 		= СтруктураЦветов.ЦветЦифры;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбщиеНастройки(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбщиеНастройки;
	Элементы.ОбщиеНастройки.Пометка = Истина;
	
	Элементы[ПредыдущаяКоманда].Шрифт = Новый Шрифт(, 8, Ложь, , , );
	Элементы.ОбщиеНастройки.Шрифт = Новый Шрифт(, 8, Истина, , , );
	
	ЗаголовокСтраницы = "Общие настройки";
	ПредыдущаяКоманда = "ОбщиеНастройки";
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПоиском(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеПоиском;
	Элементы.ОбщиеНастройки.Пометка = Истина;
	
	Элементы[ПредыдущаяКоманда].Шрифт = Новый Шрифт(, 8, Ложь, , , );
	Элементы.УправлениеПоиском.Шрифт = Новый Шрифт(, 8, Истина, , , );
	
	ЗаголовокСтраницы = "Управление поиском";
	ПредыдущаяКоманда = "УправлениеПоиском";
	
КонецПроцедуры

&НаКлиенте
Процедура БизнесПроцессы(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаБизнесПроцессы;
	Элементы.ОбщиеНастройки.Пометка = Истина;
	
	Элементы[ПредыдущаяКоманда].Шрифт = Новый Шрифт(, 8, Ложь, , , );
	Элементы.БизнесПроцессы.Шрифт = Новый Шрифт(, 8, Истина, , , );
	
	ЗаголовокСтраницы = "Бизнес-процессы";
	ПредыдущаяКоманда = "БизнесПроцессы";
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеСправочнойИнформацией(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаУправлениеСправочнойИнформацией;
	Элементы.ОбщиеНастройки.Пометка = Истина;
	
	Элементы[ПредыдущаяКоманда].Шрифт = Новый Шрифт(, 8, Ложь, , , );
	Элементы.УправлениеСправочнойИнформацией.Шрифт = Новый Шрифт(, 8, Истина, , , );
	
	ЗаголовокСтраницы = "Управление справочной информацией";
	ПредыдущаяКоманда = "УправлениеСправочнойИнформацией";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменДанными(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОбменДанными;
	Элементы.ОбщиеНастройки.Пометка = Истина;
	
	Элементы[ПредыдущаяКоманда].Шрифт = Новый Шрифт(, 8, Ложь, , , );
	Элементы.ОбменДанными.Шрифт = Новый Шрифт(, 8, Истина, , , );
	
	ЗаголовокСтраницы = "Обмен данными";
	ПредыдущаяКоманда = "ОбменДанными";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура нсиИспользоватьПодсистемуКонтрагентовПриИзменении(Элемент)
	
	Если не НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов Тогда 
		НаборКонстант.нсиИспользоватьПодсистемуДоговоровСПокупателями	= Ложь;
		НаборКонстант.нсиИспользоватьПодсистемуДоговоровСПоставщиками	= Ложь;
		НаборКонстант.нсиИспользоватьПодсистемуБанковскихСчетов 		= Ложь;
	КонецЕсли;	
	
	Элементы.нсиИспользоватьПодсистемуДоговоровСПокупателями.Доступность = НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов;
	Элементы.нсиИспользоватьПодсистемуДоговоровСПоставщиками.Доступность = НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов;
	Элементы.нсиИспользоватьПодсистемуБанковскихСчетов.Доступность 		= НаборКонстант.нсиИспользоватьПодсистемуКонтрагентов;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СтруктураЦветов = Новый Структура;
	СтруктураЦветов.Вставить("ЦветКириллицы", ЦветКириллицы);
	СтруктураЦветов.Вставить("ЦветЛатиницы", ЦветЛатиницы);
	СтруктураЦветов.Вставить("ЦветЦифры", ЦветЦифры);
	Константы.нсиНастройкаЦветовВизуализации.Установить(Новый ХранилищеЗначения(СтруктураЦветов));
КонецПроцедуры

#КонецОбласти

