
&НаКлиенте
Процедура Синхронизация(Команда)
	
	dataKey = "GlobalPartners";
	Если СинхронизацияНаСервере(dataKey) Тогда
		Сообщить("Выполнена синхронизация справочника "+dataKey);
		ОповеститьОбИзменении(Тип("СправочникСсылка."+dataKey)); 
	Иначе
		Сообщить("Синхронизация справочника не выполнена "+dataKey);
	КонецЕсли; 
	Сообщить("Процедура синхронизации завершена.");

КонецПроцедуры

&НаСервереБезКонтекста
Функция СинхронизацияНаСервере(dataKey)
	
	Возврат GlobEx.СинхронизацияGlobal(dataKey, Истина);
	
КонецФункции
