
&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	Объект.Наименование = Объект.ЕдиницаПоКлассификатору;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроизводительСписокВыбора = Элементы.ЕдиницыПроизводителейПроизводитель.СписокВыбора;
	Для каждого СтрокаGlobalID Из Объект.Владелец.GlobalID Цикл
		ПроизводительСписокВыбора.Добавить(СтрокаGlobalID.Производитель);
	КонецЦикла;
	
	ТипМатериала = Объект.Владелец.LocalMaterialType;
	
	Если НЕ ЗначениеЗаполнено(ТипМатериала) Тогда
	
		Сообщить("Не заполнено поле Тип материала у номенклатуры владельца.");
		Отказ = Истина;
	
	КонецЕсли;
	
	Элементы.ГруппаХарактеристики.Видимость = НЕ ТипМатериала.ГотоваяПродукция;
	Элементы.ГруппаЕдиницыПроизводителей.Видимость = ТипМатериала.ГотоваяПродукция;
	
	//Кутья АА
	GUID_MDM = Объект.Ссылка.УникальныйИдентификатор();

КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыПроизводителейПроизводительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.ЕдиницыПроизводителей.НайтиСтроки(Новый Структура("Производитель", ВыбранноеЗначение)).Количество() Тогда
		СтандартнаяОбработка = Ложь;
		Сообщить("В табличной части уже есть строка с производителем "+ВыбранноеЗначение);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыПроизводителейДлинаПриИзменении(Элемент)
	РассчитатьОбъемМ3();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыПроизводителейШиринаПриИзменении(Элемент)
	РассчитатьОбъемМ3();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыПроизводителейВысотаПриИзменении(Элемент)
	РассчитатьОбъемМ3();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбъемМ3()

	ТекущиеДанные = Элементы.ЕдиницыПроизводителей.ТекущиеДанные;
	ТекущиеДанные.ОбъемМ3 = ТекущиеДанные.Длина*ТекущиеДанные.Ширина*ТекущиеДанные.Высота/1000000000;

КонецПроцедуры // РассчитатьОбъемМ3()


&НаКлиенте
Процедура ТипШтрихкодаПриИзменении(Элемент)
	ШтрихКодТолькоПросмотр();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ШтрихКодТолькоПросмотр();
КонецПроцедуры
 
&НаКлиенте
Процедура ШтрихКодТолькоПросмотр()

	Элементы.Штрихкод.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.ТипШтрихкода);

КонецПроцедуры // ШтрихКодТолькоПросмотр()


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//КутьяАА ITRR <<
	УИ = Объект.Ссылка.УникальныйИдентификатор();
	Если НЕ GUID_MDM = УИ Тогда
		GUID_MDM = УИ;
	КонецЕсли; 
	//>>
КонецПроцедуры
 