#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем БезТабличныхЧастей;
	
	Если Параметры.Отбор.Свойство("ВидСправочника") Тогда
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("БезТабличныхЧастей", БезТабличныхЧастей) Тогда
		Если БезТабличныхЧастей Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидСправочника");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ЭлементОтбора.ПравоеЗначение = Перечисления.нсиВидыСправочников.ТабличнаяЧасть;
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
