
Процедура ПередЗаписью(Отказ)
	#Если Сервер ИЛИ ВнешнееСоединение тогда
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Справочник_Организации");
	// Конец СтандартныеПодсистемы.Свойства
	#КонецЕсли
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	MDMСервер.ПроверитьСвязанныйСправочник(Ссылка, "алкПунктыРазгрузки", "алкОсновнойПунктРазгрузки",ПроверяемыеРеквизиты);
	MDMСервер.ПроверитьСвязанныйСправочник(Ссылка, "алкЛицензии", "алкОсновнаяЛицензия",ПроверяемыеРеквизиты);
	
КонецПроцедуры
