Функция ПолучитьНастройку(ИД) Экспорт 
	
	Результат = Новый Структура;
	
	НастройкаОбмена = Справочники.Обмены.НайтиПоКоду(ИД);
	Если НастройкаОбмена = Неопределено Тогда
		Результат.Вставить("error", "Не найдена настройка обмена по идентификатору "+ИД);
	Иначе
		Результат = ВыгрузитьНастройкуВСтруктуру(НастройкаОбмена);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции // ПолучитьПараметрыWS()

Функция ВыгрузитьНастройкуВСтруктуру(НастройкаОбмена)

	Настройка = Новый Структура;
	Для каждого СтрокаНастройки Из НастройкаОбмена.Настройки Цикл
		Настройка.Вставить(СтрокаНастройки.Ключ, СтрокаНастройки.Значение);
	КонецЦикла; 
	Настройка.Вставить("НастройкаОбмена", НастройкаОбмена);
	
	Возврат Настройка;
	
КонецФункции // ВыгрузитьНастройкуВСтруктуру()

