#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Э Из Параметры.НаправленияОбработки Цикл 
		НС = НаправленияОбработки.Добавить();
		НС.НаправлениеОбработки = Э.Значение;
	КонецЦикла;
	
	Строки = НаправленияОбработки.НайтиСтроки(новый Структура("НаправлениеОбработки",Параметры.НаправлениеОбработки));
	Если Строки.Количество()>0 Тогда 
		Строки[0].Пометка = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Строки = НаправленияОбработки.НайтиСтроки(новый Структура("Пометка",Истина));
	Если Строки.Количество()>0 Тогда 
		Закрыть(Строки[0].НаправлениеОбработки);
	Иначе
		Закрыть(ПредопределенноеЗначение("Справочник.нсиГруппыПользователейБП.Основная"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаправления

&НаКлиенте
Процедура НаправленияОбработкиПометкаПриИзменении(Элемент)
	ТД = Элементы.НаправленияОбработки.ТекущиеДанные;
	Пометка = ТД.Пометка;
	Если Пометка Тогда 
		Для Каждого Строка Из НаправленияОбработки Цикл 
			Строка.Пометка = Ложь;
		КонецЦикла;
		ТД.Пометка = Пометка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти