
&НаСервереБезКонтекста
Процедура ВыгрузкаВAXНаСервере()
	AxapEx.Exchange_MDM_to_AxaptaMRP();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаВAX(Команда)
	ВыгрузкаВAXНаСервере();
	Элементы.Список.Обновить();
	Сообщить("Выгрузка в AX завершена.");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Данные" Тогда
		СтандартнаяОбработка = Ложь;
		Данные = Элементы.Список.ТекущиеДанные.Данные;
		Если ЗначениеЗаполнено(Данные) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Данные);
			ОткрытьФорму(СтрШаблон("Справочник.%1.ФормаОбъекта", ПолучитьИмяСпр(Данные)), ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;  
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяСпр(Данные)

	Возврат Данные.Метаданные().Имя;

КонецФункции // ПолучитьИмяСпр()
 
