
#Область СлужебныеПроцедурыИФункции

// Процедура заполняет список справочников системы.
//
Процедура ЗаполнитьСписокСправочников(Список) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Список.Очистить();
	
	Список.Добавить("нсиБанковскиеСчета");
	Список.Добавить("нсиДоговорыСПокупателями");
	Список.Добавить("нсиДоговорыСПоставщиками");
	Список.Добавить("нсиМТР");
	Список.Добавить("нсиУслуги");
	Список.Добавить("нсиКонтрагенты");
	
	Список.Добавить("Валюты");
	Список.Добавить("нсиБанки");
	Список.Добавить("КлассификаторБанковРФ");
	Список.Добавить("нсиВидыСтруктурныхЕдиниц");
	Список.Добавить("нсиДолжности");
	Список.Добавить("нсиЕдиницыИзмерения");
	Список.Добавить("нсиДолжности");
	Список.Добавить("нсиЕдиницыИзмерения");
	Список.Добавить("нсиНормативноТехническиеДокументы");
	Список.Добавить("нсиОрганизационноПравовыеФормы");
	Список.Добавить("нсиСтруктураПредприятия");
	Список.Добавить("Организации");
	Список.Добавить("СтраныМира");
	
	Список.Добавить("нсиКлассификаторПродукции");
	Список.Добавить("нсиКлассификаторУслуг");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Справочники.Ссылка
		|ИЗ
		|	Справочник.нсиВидыСправочников КАК Справочники
		|ГДЕ
		|	Справочники.ВидСправочника <> ЗНАЧЕНИЕ(Перечисление.нсиВидыСправочников.ТабличнаяЧасть)
		|	И НЕ Справочники.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Наименование"
	);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	нсиВидыДополнительныхКлассификаторов.Ссылка
		|ИЗ
		|	Справочник.нсиВидыДополнительныхКлассификаторов КАК нсиВидыДополнительныхКлассификаторов
		|ГДЕ
		|	НЕ нсиВидыДополнительныхКлассификаторов.ПометкаУдаления"
	);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Для Каждого Элемент Из Список Цикл
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда 
			Элемент.Представление = Метаданные.Справочники[Элемент.Значение].Синоним;
		Иначе
			Элемент.Представление = Строка(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Список.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

