
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс для подсистемы бизнес-процессов и задач

// Получить структуру с описанием формы выполнения задачи.
// Вызывается при открытии формы выполнения задачи.
//
// Параметры
//   ЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – задача 
//   ТочкаМаршрутаСсылка – точка маршрута 
//
// Возвращаемое значение:
//   Структура   – структуру с описанием формы выполнения задачи.
//                 Ключ "ИмяФормы" содержит имя формы, передаваемое в метод контекста ОткрытьФорму(). 
//                 Ключ "ПараметрыФормы" содержит параметры формы. 
//
Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ", ЗадачаСсылка));
	Результат.Вставить("ИмяФормы", "БизнесПроцесс.Задание.Форма.Действие" + ТочкаМаршрутаБизнесПроцесса.Имя);
	Возврат Результат;
	
КонецФункции

// Вызывается при перенаправлении задачи.
//
// Параметры
//   ЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – перенаправляемая задача.
//   НоваяЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – задача для нового исполнителя.
//
Процедура ПриПеренаправленииЗадачи(ЗадачаСсылка, НоваяЗадачаСсылка) Экспорт
	
	//БизнесПроцессОбъект = ЗадачаСсылка.БизнесПроцесс.ПолучитьОбъект();
	//ЗаблокироватьДанныеДляРедактирования(БизнесПроцессОбъект.Ссылка);
	//БизнесПроцессОбъект.РезультатВыполнения = РезультатВыполненияПриПеренаправлении(ЗадачаСсылка) + 
	//	БизнесПроцессОбъект.РезультатВыполнения;
	//УстановитьПривилегированныйРежим(Истина);
	//БизнесПроцессОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры

Процедура УстановитьСостояниеЭлементовФормыЗадачи(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаданиеОбъект = Форма.РеквизитФормыВЗначение("Задание");
	Форма.Элементы.РезультатВыполнения.Видимость = НЕ ПустаяСтрока(ЗаданиеОбъект.РезультатВыполнения);
	Форма.Элементы.Предмет.Гиперссылка = ЗаданиеОбъект.Предмет <> Неопределено И НЕ ЗаданиеОбъект.Предмет.Пустая();
	Форма.ПредметСтрокой = нсиБизнесПроцессы.ПредметСтрокой(ЗаданиеОбъект.Предмет);	
	
КонецПроцедуры	

#КонецОбласти
