
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолеКомпоновкиСсылка = Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Ссылка").Поле;
	
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
		
			Элементы.Отбор.Пометка = ЭлементОтбора.Использование;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеОтбором(Использование)

	ПолеКомпоновкиСсылка = Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Ссылка").Поле;
	
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
		
			ЭлементОтбора.Использование = Использование;
		
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры // УправлениеОтбором()

&НаКлиенте
Процедура Отбор(Команда)
	
	Элементы.Отбор.Пометка = НЕ Элементы.Отбор.Пометка;
	
	УправлениеОтбором(Элементы.Отбор.Пометка);
	
КонецПроцедуры
 


