// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция СформироватьСписокНаименований()	Экспорт

	МассивНаименований = Новый Массив;
	
	РегСведений = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	РегСведений.Отбор.Объект.Значение = Ссылка;
	РегСведений.Отбор.Объект.Использование = Истина;
	РегСведений.Отбор.Тип.Значение = Перечисления.ТипыКонтактнойИнформации.Адрес;
	РегСведений.Отбор.Тип.Использование = Истина;
	РегСведений.Отбор.Вид.Значение = Справочники.ВидыКонтактнойИнформации.АдресПунктаРазгрузки;
	РегСведений.Отбор.Вид.Использование = Истина;
	
	РегСведений.Прочитать();
	
	Если РегСведений.Количество() > 0 Тогда
		СтрСведений = РегСведений[0];
		
		//Улица
		СтрНаименования = СокрЛП(СтрСведений.Поле6);
		Если Не ОбщегоНазначения.ЗначениеНЕЗаполнено(СтрНаименования) Тогда
			МассивНаименований.Добавить(СтрНаименования);
		КонецЕсли;
		//Регион
		СтрНаименования = СокрЛП(СтрСведений.Поле2);
		Если Не ОбщегоНазначения.ЗначениеНЕЗаполнено(СтрНаименования) Тогда
			МассивНаименований.Добавить(СтрНаименования);
		КонецЕсли;
		//Регион + город
		СтрНаименования = СокрЛП(СтрСведений.Поле2)+" "+СокрЛП(СтрСведений.Поле3);
		Если Не ОбщегоНазначения.ЗначениеНЕЗаполнено(СтрНаименования) Тогда
			МассивНаименований.Добавить(СтрНаименования);
		КонецЕсли;
		//Регион + улица
		СтрНаименования = СокрЛП(СтрСведений.Поле2)+" "+СокрЛП(СтрСведений.Поле6);
		Если Не ОбщегоНазначения.ЗначениеНЕЗаполнено(СтрНаименования) Тогда
			МассивНаименований.Добавить(СтрНаименования);
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат МассивНаименований;

КонецФункции // СформироватьСписокНаименований()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СбытовыеОрганизации.Загрузить(ДанныеЗаполнения.Владелец.СбытовыеОрганизации.Выгрузить());
КонецПроцедуры
