Функция ПолучитьНастройку(ТипМатериалов, Рекурсия = Истина) Экспорт 

	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиЕдиницИзмеренияХранилище = ХранилищеОбщихНастроек.Загрузить(Строка(ТипМатериалов.УникальныйИдентификатор()),
		"НастройкиЕдиницИзмеренияПоТипамМатериалов",,"ЭкспертНСИ");
	
	Если НастройкиЕдиницИзмеренияХранилище = Неопределено
		И ЗначениеЗаполнено(ТипМатериалов)
		И ТипМатериалов.Уровень()
		И Рекурсия Тогда
		
		НастройкиЕдиницИзмеренияХранилище = ПолучитьНастройку(ТипМатериалов.Родитель, Рекурсия);
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиЕдиницИзмеренияХранилище) = Тип("ХранилищеЗначения") Тогда
	
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ВладелецНастройки", ТипМатериалов);
		СтруктураВозврата.Вставить("Настройка", ?(ТипЗнч(НастройкиЕдиницИзмеренияХранилище) = Тип("ХранилищеЗначения"),НастройкиЕдиницИзмеренияХранилище.Получить(),НастройкиЕдиницИзмеренияХранилище));
	
	Иначе
	
		СтруктураВозврата = НастройкиЕдиницИзмеренияХранилище;
	
	КонецЕсли; 

	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьНастройку()

Процедура СохранитьНастройку(ТипМатериалов, НастройкиЕдиницИзмерения) Экспорт 

	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Сохранить(Строка(ТипМатериалов.УникальныйИдентификатор()),
		"НастройкиЕдиницИзмеренияПоТипамМатериалов",Новый ХранилищеЗначения(НастройкиЕдиницИзмерения),,"ЭкспертНСИ");

КонецПроцедуры
 
Процедура УдалитьНастройку(ТипМатериалов) Экспорт 

	УстановитьПривилегированныйРежим(Истина);
	
	КлючОбъекта = Строка(ТипМатериалов.УникальныйИдентификатор());
	КлючНастроек = "НастройкиЕдиницИзмеренияПоТипамМатериалов";
	Пользователь = "ЭкспертНСИ";
	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючОбъекта", КлючОбъекта);
	Отбор.Вставить("КлючНастроек", КлючНастроек);
	Отбор.Вставить("Пользователь", Пользователь);
	
	ХранилищеВыборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
	Пока ХранилищеВыборка.Следующий() Цикл
		
		ХранилищеОбщихНастроек.Удалить(КлючОбъекта, КлючНастроек, Пользователь);
		
	КонецЦикла; 

КонецПроцедуры
