Процедура ВыполнитьРегистрациюДляAX(Ссылка) Экспорт 

	Возврат; //временно отключено
	
	ПринадлежитAX = Метаданные.ПланыОбмена.Обмен_MDM_AX.Состав.Содержит(Ссылка.Метаданные());
	
	Если НЕ ПринадлежитAX Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Узел = ПолучитьУзелОбменаAX();
	
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Ссылка) = Тип("РегистрСведенийНаборЗаписей.КонтактнаяИнформация") Тогда
		Ссылка = ПланыОбмена.Обмен_МДМ_УПП.ПреобразоватьСсылкуПоВладельцу(Ссылка);
	КонецЕсли;
	
	нсиКонтрагенты = ТипЗнч(Ссылка) = Тип("СправочникСсылка.нсиКонтрагенты");
	ДоговорыКонтрагентов = ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов");
	
	Регистрировать = НЕ (нсиКонтрагенты ИЛИ ДоговорыКонтрагентов) 
						ИЛИ (нсиКонтрагенты И (Ссылка.Поставщик ИЛИ Ссылка.Покупатель)) 
						ИЛИ (ДоговорыКонтрагентов И Ссылка.Владелец.Поставщик);
	
	Если Регистрировать Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Ссылка);
	КонецЕсли; 

КонецПроцедуры
 
Функция ПолучитьУзелОбменаAX() Экспорт 

	ВыборкаУзлов = ПланыОбмена.Обмен_MDM_AX.Выбрать();
	
	Узел = ПланыОбмена.Обмен_MDM_AX.ПустаяСсылка();
	Пока ВыборкаУзлов.Следующий() Цикл
		Если НЕ ВыборкаУзлов.ЭтотУзел Тогда
			Узел = ВыборкаУзлов.Ссылка;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Узел;
	
КонецФункции // ПолучитьУзелОбмена()
