
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код,Наименование,ПолноеНаименование"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_НастройкиШаблоновНаименований = Новый Структура;
	Настройки_НастройкиШаблоновНаименований.Вставить("КлючСтроки", "ТипЭлемента,ЭлементНаименования");
	Настройки_НастройкиШаблоновНаименований.Вставить("Реквизиты" , "ТипЭлемента,ЭлементНаименования,ПрефиксЗначения,ПостфиксЗначения,Использование");
	Настройки_НастройкиШаблоновНаименований.Вставить("Элемент"   , "НастройкиШаблоновНаименований");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("НастройкиШаблоновНаименований", Настройки_НастройкиШаблоновНаименований);
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийМенеджераСправочника

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Данные.Владелец.РеквизитПредставления = Справочники.нсиПредопределенныеРеквизиты.Код Тогда 
		Представление = СокрЛП(Данные.Код);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	Поля.Добавить("Владелец");
КонецПроцедуры

#КонецОбласти
