#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	 ПараметрыФормы = Новый Структура("Класс", Класс(ПараметрКоманды));
	 ОткрытьФорму("Справочник.нсиМТР.ФормаСписка", 
		 ПараметрыФормы, 
		 ПараметрыВыполненияКоманды.Источник, 
		 ПараметрыВыполненияКоманды.Уникальность, 
		 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция Класс(Ссылка)
	
	ЭтоМакет = нсиОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "ЭтоМакет");
	
	Если ЭтоМакет тогда
		ИзменяемыйОбъект = РегистрыСведений.нсиСтатусыОбработкиСправочников.ИзменяемыйОбъект(Ссылка);
		Если ЗначениеЗаполнено(ИзменяемыйОбъект) тогда
			Возврат ИзменяемыйОбъект
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Ссылка
	
КонецФункции	

#КонецОбласти