// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция СформироватьНаименование() Экспорт

	СтрокаНаименования = "";
	
	Если ЗначениеЗаполнено(Серия) Тогда
		СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="","",", ")
			+ СокрЛП(Серия);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номер) Тогда
		СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="",""," ")
			+ СокрЛП(Номер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="",""," ")
			+ "рег.№ "+СокрЛП(РегистрационныйНомер);
	КонецЕсли;
	
	СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="",""," ")
		+ "("+Формат(ДатаНачалаСрокаДействия, "ДФ=dd.MM.yy")+"-"+Формат(ДатаОкончанияСрокаДействия, "ДФ=dd.MM.yy")+")";
	
	Возврат СтрокаНаименования;

КонецФункции // СформироватьНаименование()