#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
//	MOD Нач Кутья АА	

	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для каждого Сеанс Из Сеансы Цикл
		Если Сеанс.НомерСеанса = НомерСеансаИнформационнойБазы() Тогда
			ТекущийСеанс = Сеанс;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ЗначениеЗаполнено(ИменаПараметровСеанса) И НЕ ТекущийСеанс = Неопределено И НЕ ПредставлениеПриложения(ТекущийСеанс.ИмяПриложения) = "Фоновое задание" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	итГруппыУправленияНСИСостав.Ссылка.ИспользоватьРазделениеНСИ КАК ИспользоватьРазделениеНСИ,
		|	итГруппыУправленияНСИСостав.Ссылка КАК ГруппаУправленияНСИ
	//	|	итГруппыУправленияНСИСостав.Ссылка.СтранаОрганизации
		|ИЗ
		|	Справочник.итГруппыУправленияНСИ.Состав КАК итГруппыУправленияНСИСостав
		|ГДЕ
		|	итГруппыУправленияНСИСостав.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ПараметрыСеанса.ГруппаУправленияНСИ = ВыборкаДетальныеЗаписи.ГруппаУправленияНСИ;
		//	Если ВыборкаДетальныеЗаписи.ИспользоватьРазделениеНСИ Тогда
		//		ПараметрыСеанса.СтранаОрганизацииЗначение = ВыборкаДетальныеЗаписи.СтранаОрганизации;
		//		ПараметрыСеанса.СтранаОрганизацииИспользование = Истина;
		//	КонецЕсли; 
		//Иначе
		//	ПараметрыСеанса.СтранаОрганизацииЗначение = Справочники.GlobalEntityCountry.ПустаяСсылка();
		//	ПараметрыСеанса.СтранаОрганизацииИспользование = Истина;
		КонецЕсли;  

	КонецЕсли;
	//MOD Кон Кутья АА	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли