#Область ПрограммныйИнтерфейс

// Процедура регистрации изменений: перед записью
//
Процедура ОбменСправочнойИнформациейЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	//фыв-- тут принудительная регистрация изменений происходила 
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменСправочнойИнформацией", Источник, Отказ);
	
КонецПроцедуры

// Процедура регистрации изменений: перед удалением
//
Процедура ОбменСправочнойИнформациейЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	//фыв-- тут принудительная регистрация изменений происходила
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменСправочнойИнформацией", Источник, Отказ);
	
КонецПроцедуры

// Процедура регистрации изменений: перед записью константы
//
Процедура ОбменСправочнойИнформациейЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ) Экспорт
	//фыв-- тут принудительная регистрация изменений происходила
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("ОбменСправочнойИнформацией", Источник, Отказ);

КонецПроцедуры

#КонецОбласти