
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код,Наименование,ПолноеНаименование"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_ТехническиеХарактеристики = Новый Структура;
	Настройки_ТехническиеХарактеристики.Вставить("КлючСтроки"     , "Характеристика");
	Настройки_ТехническиеХарактеристики.Вставить("Реквизиты"      , "Значение");
	Настройки_ТехническиеХарактеристики.Вставить("РеквизитФормы"  , "ТехническиеХарактеристикиФорма");
	Настройки_ТехническиеХарактеристики.Вставить("Элемент"        , "ТехническиеХарактеристикиФорма");
	
	Настройки_ДополнительнаяКлассификация = Новый Структура;
	Настройки_ДополнительнаяКлассификация.Вставить("КлючСтроки", "ВидКлассификатора,Класс");
	Настройки_ДополнительнаяКлассификация.Вставить("Реквизиты" , "");
	Настройки_ДополнительнаяКлассификация.Вставить("Элемент"   , "ДополнительнаяКлассификация");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("ТехническиеХарактеристики"     , Настройки_ТехническиеХарактеристики);
	НастройкиОформления.Вставить("ДополнительнаяКлассификация"   , Настройки_ДополнительнаяКлассификация);	
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийМенеджераСправочника

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Данные.Владелец.РеквизитПредставления = Справочники.нсиПредопределенныеРеквизиты.Код Тогда 
		Представление = СокрЛП(Данные.Код);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	Поля.Добавить("Владелец");
КонецПроцедуры

#КонецОбласти
