#Область СлужебныеПроцедурыИФункции

// Получить структуру с описанием формы выполнения задачи.
// Вызывается при открытии формы выполнения задачи.
//
// Параметры
//   ЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – задача 
//   ТочкаМаршрутаСсылка – точка маршрута 
//
// Возвращаемое значение:
//   Структура   – структуру с описанием формы выполнения задачи.
//                 Ключ "ИмяФормы" содержит имя формы, передаваемое в метод контекста ОткрытьФорму(). 
//                 Ключ "ПараметрыФормы" содержит параметры формы. 
//
Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ", ЗадачаСсылка));
	Результат.Вставить("ИмяФормы", "БизнесПроцесс.нсиПакетныйВводЭлементовСправочника.Форма.Действие" + 
		ТочкаМаршрутаБизнесПроцесса.Имя);
	Возврат Результат;
	
КонецФункции

// Вызывается при выполнении задачи из формы списка.
//
// Параметры
//   ЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – задача 
//   ТочкаМаршрутаСсылка – точка маршрута 
//
Процедура ОбработкаВыполненияПоУмолчанию(ЗадачаСсылка, БизнесПроцессСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	// устанавливаем значения по умолчанию для пакетного выполнения задач
	
	ЗаданиеОбъект = БизнесПроцессСсылка.ПолучитьОбъект();
	ЗаблокироватьДанныеДляРедактирования(ЗаданиеОбъект.Ссылка);
	ЗаданиеОбъект.Выполнено = Истина;	
	
	Если ТочкаМаршрутаБизнесПроцесса = ТочкиМаршрута.ОбработкаИнформации Тогда
		Если нсиБизнесПроцессы.НайтиВспомогательныеПроцессы(БизнесПроцессСсылка) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			" Для этого задания есть запросы на доп. информацию.
			| обработка информации не может быть закончена.");
			ЗаданиеОбъект.Выполнено = Ложь;	
		КонецЕсли;	
	КонецЕсли;
	
	ЗаданиеОбъект.Записать();
	
КонецПроцедуры	

Функция ПолучитьШаги() Экспорт
	Шаги = новый Массив;
	Шаги.Добавить(Перечисления.нсиШагиБП.РаспределениеЗадач);
	Шаги.Добавить(Перечисления.нсиШагиБП.Обработка);
	Шаги.Добавить(Перечисления.нсиШагиБП.Утверждение);
	Возврат Шаги;
КонецФункции

#КонецОбласти