
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.Отбор.ВидКлассификатора) Тогда 
		ВидКлассификатора = Параметры.ВидКлассификатора;
		нсиРаботаСФормами.ОтборВСпискеПоЗначению(Список.Отбор.Элементы,"ВидКлассификатора",ВидКлассификатора);
	Иначе
		ВидКлассификатора = Параметры.Отбор.ВидКлассификатора;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидКлассификатора) Тогда 
		Элементы.ВидКлассификатора.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидКлассификатораПриИзменении(Элемент)
	нсиРаботаСФормами.ОтборВСпискеПоЗначению(Список.Отбор.Элементы,"ВидКлассификатора",ВидКлассификатора);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОткрытьФорму("ПланВидовХарактеристик.нсиНаименованияХарактеристикУниверсальногоСправочника.ФормаОбъекта",
		новый Структура("ЗначенияЗаполнения", новый Структура("ВидКлассификатора",ВидКлассификатора)),
		ЭтаФорма
	);
КонецПроцедуры

#КонецОбласти


