#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда 
		Элементы.ВидыКлассификаторов.Видимость = Ложь;
		Элементы.Отбор.Видимость = Ложь;
		Заголовок = Строка(Параметры.Отбор.Владелец);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидыКлассификаторовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ВидыКлассификаторов.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.ВидыКлассификаторов.ВыделенныеСтроки[0];
	
	ЭлементОтбора = нсиРаботаСФормами.ОтборВСпискеПоЗначению(Список.Отбор.Элементы, 
		"Владелец", ТекущиеДанные, ВидСравненияКомпоновкиДанных.Равно, 
		ЗначениеЗаполнено(ТекущиеДанные) И ТипЗнч(ТекущиеДанные) = Тип("СправочникСсылка.нсиВидыДополнительныхКлассификаторов") );
	ЭлементОтбора.Представление = "По виду классификатора";	
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры


#КонецОбласти
